#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.common: Reading...
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 1s [id=projects/-/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudresourcemanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iam.googleapis.com]
module.enable_google_apis.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/run.googleapis.com]
module.enable_google_apis.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/artifactregistry.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudscheduler.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudscheduler.googleapis.com]
module.enable_google_apis.google_project_service.project_services["youtube.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/youtube.googleapis.com]
module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/pubsub.googleapis.com]
module.enable_google_apis.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/bigquery.googleapis.com]
module.enable_google_apis.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/secretmanager.googleapis.com]
data.terraform_remote_state.common: Read complete after 3s
module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/storage.googleapis.com]
module.enable_google_apis.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/sts.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iamcredentials.googleapis.com]
module.pubsub_topic.google_pubsub_topic.main: Refreshing state... [id=projects/youtube-data-api-385206/topics/dev-youtube-data-api]
module.storage.google_storage_bucket.bucket: Refreshing state... [id=dev-youtube-data-api-385206-bucket]
module.pubsub_topic.google_pubsub_topic_iam_member.topic_publisher_role: Refreshing state... [id=projects/youtube-data-api-385206/topics/dev-youtube-data-api/roles/pubsub.publisher/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.pubsub_topic.google_pubsub_topic.main_dead_letter: Refreshing state... [id=projects/youtube-data-api-385206/topics/dev-dev-youtube-data-api-dlq]
module.storage.google_storage_bucket_iam_member.member: Refreshing state... [id=b/dev-youtube-data-api-385206-bucket/roles/storage.admin/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.run.google_cloud_run_v2_service.api: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/services/dev-youtube-data-api-api]
module.run.google_cloud_run_service_iam_member.api_invoker: Refreshing state... [id=v1/projects/youtube-data-api-385206/locations/asia-northeast1/services/dev-youtube-data-api-api/roles/run.invoker/serviceAccount:cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com]
module.scheduler.google_cloud_scheduler_job.invoke-transfer: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/jobs/dev-invoke-transfer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.pubsub_subscription.google_pubsub_subscription.main will be created
  + resource "google_pubsub_subscription" "main" {
      + ack_deadline_seconds       = 599
      + effective_labels           = (known after apply)
      + enable_message_ordering    = false
      + id                         = (known after apply)
      + message_retention_duration = "1200s"
      + name                       = "dev-youtube-data-api-sub"
      + project                    = "youtube-data-api-385206"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/youtube-data-api-385206/topics/dev-youtube-data-api"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/youtube-data-api-385206/topics/dev-dev-youtube-data-api-dlq"
          + max_delivery_attempts = 5
        }

      + expiration_policy {
            # (1 unchanged attribute hidden)
        }

      + push_config {
          + push_endpoint = "https://dev-youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke/load"

          + oidc_token {
              + service_account_email = "cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com"
            }
        }

      + retry_policy {
          + maximum_backoff = (known after apply)
          + minimum_backoff = "10s"
        }
    }

  # module.pubsub_subscription.google_pubsub_subscription_iam_member.subscription_subscriber_role will be created
  + resource "google_pubsub_subscription_iam_member" "subscription_subscriber_role" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com"
      + project      = (known after apply)
      + role         = "roles/pubsub.subscriber"
      + subscription = "dev-youtube-data-api-sub"
    }

  # module.run.google_cloud_run_v2_service.api will be updated in-place
  ~ resource "google_cloud_run_v2_service" "api" {
        id                      = "projects/youtube-data-api-385206/locations/asia-northeast1/services/dev-youtube-data-api-api"
        name                    = "dev-youtube-data-api-api"
        # (30 unchanged attributes hidden)

      ~ template {
            # (9 unchanged attributes hidden)

          ~ containers {
              ~ image       = "asia-northeast1-docker.pkg.dev/youtube-data-api-385206/dev-youtube-data-api-repository/youtube-data-api:69c54bddd37a7c44b44671003b6edd034910cd44" -> "asia-northeast1-docker.pkg.dev/youtube-data-api-385206/dev-youtube-data-api-repository/dev-api-image:bf38ecd2ed5d06d3d0900574d915ec296ba24a0f"
                name        = null
                # (4 unchanged attributes hidden)

                # (10 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @Kamegrueon, Action: `pull_request`, Working Directory: ``, Workflow: `cicd`*